In [41]:
import pandas as pd
import re

In [42]:
url = 'https://ec.europa.eu/eurostat/statistics-explained/index.php/Glossary:Country_codes'

In [43]:
tables_df = pd.read_html(url)

In [44]:
table1_df = tables_df[0]
table2_df = tables_df[1]
table3_df = tables_df[2]
table4_df = tables_df[3]
table5_df = tables_df[4]
table6_df = tables_df[5]
table7_df = tables_df[6]
table8_df = tables_df[7]
table9_df = tables_df[8]

In [45]:
table2_df = table2_df.drop(columns=[2])

In [46]:
table3_df = table3_df.drop(columns=[2])

In [47]:
table6_df = table6_df.drop(columns=[2,5])

In [48]:
table7_df = table7_df.drop(columns=[2,5])

In [49]:
table9_df = table9_df.drop(columns=[2,5,8])

In [50]:
columns = ['Country', 'CountryCode']

In [51]:
table1_1 = table1_df[[0,1]]
table1_1.columns = columns
table1_2 = table1_df[[2,3]]
table1_2.columns = columns
table1_3 = table1_df[[4,5]]
table1_3.columns = columns
table1_4 = table1_df[[6,7]]
table1_4.columns = columns

In [52]:
table1 = pd.concat([table1_1, table1_2, table1_3, table1_4],axis=0)
table1.reset_index(drop=True, inplace=True)

In [53]:
table2_1 = table2_df[[0,1]]
table2_1.columns = columns
table2_2 = table2_df[[3,4]]
table2_2.columns = columns
table2 = pd.concat([table2_1, table2_2],axis=0)
table2.reset_index(drop=True, inplace=True)
table2

         Country CountryCode
0        Iceland        (IS)
1  Liechtenstein        (LI)
2         Norway        (NO)
3    Switzerland        (CH)

In [54]:
table3_df.columns = columns
table3_df

          Country CountryCode
0  United Kingdom        (UK)

In [55]:
table4_df.columns = columns
table4_df

           Country CountryCode
0       Montenegro        (ME)
1  North Macedonia        (MK)
2          Albania        (AL)
3           Serbia        (RS)
4           Turkey        (TR)

In [56]:
table5_df.columns = columns
table5_df

                  Country CountryCode
0  Bosnia and Herzegovina        (BA)
1                 Kosovo*     (XK[1])

In [57]:
table6_df

            0     1        3     4        6     7
0     Armenia  (AM)  Belarus  (BY)  Georgia  (GE)
1  Azerbaijan  (AZ)  Moldova  (MD)  Ukraine  (UA)

In [58]:
table6_1 = table6_df[[0,1]]
table6_1.columns = columns
table6_2 = table6_df[[3,4]]
table6_2.columns = columns
table6_3 = table6_df[[6,7]]
table6_3.columns = columns
table6 = pd.concat([table6_1, table6_2, table6_3],axis=0)
table6.reset_index(drop=True, inplace=True)
table6

      Country CountryCode
0     Armenia        (AM)
1  Azerbaijan        (AZ)
2     Belarus        (BY)
3     Moldova        (MD)
4     Georgia        (GE)
5     Ukraine        (UA)

In [59]:
table7_1 = table7_df[[0,1]]
table7_1.columns = columns
table7_2 = table7_df[[3,4]]
table7_2.columns = columns
table7_3 = table7_df[[6,7]]
table7_3.columns = columns
table7 = pd.concat([table7_1, table7_2, table7_3],axis=0)
table7.reset_index(drop=True, inplace=True)
table7

          Country CountryCode
0         Algeria        (DZ)
1           Egypt        (EG)
2          Israel        (IL)
3          Jordan        (JO)
4         Lebanon        (LB)
5           Libya        (LY)
6         Morocco        (MA)
7   Palestine [2]        (PS)
8           Syria        (SY)
9         Tunisia        (TN)
10            NaN         NaN
11            NaN         NaN

In [60]:
table8_df.columns = columns
table8_df

  Country CountryCode
0  Russia        (RU)

In [61]:
table9_1 = table9_df[[0,1]]
table9_1.columns = columns
table9_2 = table9_df[[3,4]]
table9_2.columns = columns
table9_3 = table9_df[[6,7]]
table9_3.columns = columns
table9_4 = table9_df[[9,10]]
table9_4.columns = columns
table9 = pd.concat([table9_1, table9_2, table9_3, table9_4],axis=0)
table9.reset_index(drop=True, inplace=True)
table9

                     Country CountryCode
0                  Argentina        (AR)
1                  Australia        (AU)
2                     Brazil        (BR)
3                     Canada        (CA)
4   China (except Hong Kong)   (CN_X_HK)
5                  Hong Kong        (HK)
6                      India        (IN)
7                      Japan        (JP)
8                     Mexico        (MX)
9                    Nigeria        (NG)
10               New Zealand        (NZ)
11                 Singapore        (SG)
12              South Africa        (ZA)
13               South Korea        (KR)
14                    Taiwan        (TW)
15             United States        (US)

In [62]:
table = pd.concat([table1, table2, table3_df, table4_df, table5_df, table6, table7, table8_df, table9],axis=0)

In [63]:
table.reset_index(drop=True, inplace=True)
table['CountryCode'].unique()

array(['(BE)', '(BG)', '(CZ)', '(DK)', '(DE)', '(EE)', '(IE)', '(EL)',
       '(ES)', '(FR)', '(HR)', '(IT)', '(CY)', '(LV)', '(LT)', '(LU)',
       '(HU)', '(MT)', '(NL)', '(AT)', '(PL)', '(PT)', '(RO)', '(SI)',
       '(SK)', '(FI)', '(SE)', nan, '(IS)', '(LI)', '(NO)', '(CH)',
       '(UK)', '(ME)', '(MK)', '(AL)', '(RS)', '(TR)', '(BA)', '(XK[1])',
       '(AM)', '(AZ)', '(BY)', '(MD)', '(GE)', '(UA)', '(DZ)', '(EG)',
       '(IL)', '(JO)', '(LB)', '(LY)', '(MA)', '(PS)', '(SY)', '(TN)',
       '(RU)', '(AR)', '(AU)', '(BR)', '(CA)', '(CN_X_HK)', '(HK)',
       '(IN)', '(JP)', '(MX)', '(NG)', '(NZ)', '(SG)', '(ZA)', '(KR)',
       '(TW)', '(US)'], dtype=object)

In [64]:
def clean_codes(column: str):
    clean_text = re.sub('[^a-zA-Z \n\.]', '', column)
    return clean_text

          Country CountryCode
0         Belgium          BE
1        Bulgaria          BG
2         Czechia          CZ
3         Denmark          DK
4         Germany          DE
..            ...         ...
70      Singapore          SG
71   South Africa          ZA
72    South Korea          KR
73         Taiwan          TW
74  United States          US

[72 rows x 2 columns]

In [112]:
table['CountryCode'] = table.apply(lambda x: clean_codes(x['CountryCode']), axis=1)
table = table[table['Country'].notna()]
table

          Country CountryCode
0         Belgium          BE
1        Bulgaria          BG
2         Czechia          CZ
3         Denmark          DK
4         Germany          DE
..            ...         ...
70      Singapore          SG
71   South Africa          ZA
72    South Korea          KR
73         Taiwan          TW
74  United States          US

[72 rows x 2 columns]

In [113]:
countrycodes = list(table['CountryCode'].unique())

In [115]:
df

     Country                          Job Title      Rural
0         AT                      Not job found      Rural
1         AT  Automatic Data Processing Planner  Non-rural
2         AT                      Not job found  Non-rural
3         AT                   Data Coordinator      Rural
4         AT                 Database Developer  Non-rural
...      ...                                ...        ...
9644      SK                                NaN  Non-rural
9645      SK                                NaN  Non-rural
9646      SK                                NaN  Non-rural
9647      SK                                NaN  Non-rural
9648      SK                                NaN  Non-rural

[9649 rows x 3 columns]

In [100]:
df = pd.read_csv('../data/processed/df_processed.csv')

In [114]:
codes_df = list(df['Country'].unique())

In [105]:
df = df.replace({'Country': 'GB'}, 'UK')
df = df.replace({'Country': 'GR'}, 'EL')

In [106]:
for code in codes_df:
    if code not in countrycodes:
        print(code)

GB
GR

In [121]:
df['Country']

0       AT
1       AT
2       AT
3       AT
4       AT
        ..
9644    SK
9645    SK
9646    SK
9647    SK
9648    SK
Name: Country, Length: 9649, dtype: object

In [130]:
def replace_country(code, country_list, code_list):
    for i in range(len(code_list)):
        if code == code_list[i]:
            return country_list[i]
        
        
code_list = table['CountryCode']
code_list

0     BE
1     BG
2     CZ
3     DK
4     DE
      ..
70    SG
71    ZA
72    KR
73    TW
74    US
Name: CountryCode, Length: 72, dtype: object

In [131]:
df['Country'] = df.apply(lambda x: replace_country(x['Country'], list(table['Country']), list(table['CountryCode'])), axis=1)

In [132]:
df

       Country                          Job Title      Rural
0      Austria                      Not job found      Rural
1      Austria  Automatic Data Processing Planner  Non-rural
2      Austria                      Not job found  Non-rural
3      Austria                   Data Coordinator      Rural
4      Austria                 Database Developer  Non-rural
...        ...                                ...        ...
9644  Slovakia                                NaN  Non-rural
9645  Slovakia                                NaN  Non-rural
9646  Slovakia                                NaN  Non-rural
9647  Slovakia                                NaN  Non-rural
9648  Slovakia                                NaN  Non-rural

[9649 rows x 3 columns]

In [235]:
data = pd.read_csv('../data/results/results.csv')
data

,Country,Rural,Job Title,Quantity,Percentage
0,Austria,Non-rural,Automatic Data Processing Customer Liaison (AD...,1,0.5%
1,Austria,Non-rural,Automatic Data Processing Planner,1,0.5%
2,Austria,Non-rural,Automatic Data Processing Systems Security Spe...,1,0.5%
3,Austria,Non-rural,Computer or Data Processing Systems Consultant,2,1.0%
4,Austria,Non-rural,Crime Data Specialist,1,0.5%
...,...,...,...,...,...
58,Austria,Rural,Geographic Information Systems Data Manager (G...,1,0.5%
59,Austria,Rural,Geographic Information Systems Database Admini...,1,0.5%
60,Austria,Rural,Internet Database Specialist,1,0.5%
61,Austria,Rural,Naval Tactical Data System--Combat Information...,1,0.5%
62,Austria,Rural,Not job found,28,14.0%

In [232]:
def report(): 
    country = (input('Please introduce a country (\'all\' for complete data): '))
    
    list_of_countries = ', '.join(list(data.Country.unique()))

    if country in list(data.Country.unique()):
        final_data = data[(data.Country == country)]
        return final_data
    
    elif country == 'all':
        return data
    
    else:
        print(f'No data available for {country}. Here is a list of countries: {list_of_countries}.\n\n')
        country = (input('Please introduce a country (\'all\' for complete data): '))

In [233]:
report()

Please introduce a country ('all' for complete data):  23as

No data available for 23as. Here is a list of countries: Austria, Belgium.

Please introduce a country ('all' for complete data):  all

'Austria, Belgium'

In [212]:
[x for x in l]

['Austria', 'Belgium']